Thank you for the detailed response.

It might be interesting to note, that when creating the resource for the first time, it does correctly determine the amount of objects that will need to be created:

```hcl
 # aws_route53_resolver_endpoint.outbound[0] will be created
  + resource "aws_route53_resolver_endpoint" "outbound" {
      + arn                = (known after apply)
      + direction          = "OUTBOUND"
      + host_vpc_id        = (known after apply)
      + id                 = (known after apply)
      + name               = "test-Outbound"
      + security_group_ids = (known after apply)
      + tags               = {
          + "Environment" = "Foo"
          + "Name"        = "test-Outbound"
          + "Terraform"   = "True"
        }

      + ip_address {
          + ip        = (known after apply)
          + ip_id     = (known after apply)
          + subnet_id = (known after apply)
        }
      + ip_address {
          + ip        = (known after apply)
          + ip_id     = (known after apply)
          + subnet_id = (known after apply)
        }
      + ip_address {
          + ip        = (known after apply)
          + ip_id     = (known after apply)
          + subnet_id = (known after apply)
        }
    }
```

Similarly, when I changed to using availablity_zone_ids as keys, the diff produced does look much better:

```hcl
  # aws_route53_resolver_endpoint.outbound[0] will be updated in-place
  ~ resource "aws_route53_resolver_endpoint" "outbound" {
        arn                = "arn:aws:route53resolver:ap-southeast-1:736176406297:resolver-endpoint/rslvr-out-c4fa0b13271a4c059"
        direction          = "OUTBOUND"
        host_vpc_id        = "vpc-0ad061ebc5941ec58"
        id                 = "rslvr-out-c4fa0b13271a4c059"
        name               = "test-Outbound"
        security_group_ids = [
            "sg-0aff877d7066a4015",
        ]
        tags               = {
            "Environment" = "Foo"
            "Name"        = "test-Outbound"
            "Terraform"   = "True"
        }

        ip_address {
            ip        = "10.10.10.189"
            ip_id     = "rni-c155d5b603e547eaa"
            subnet_id = "subnet-03fac71c002c40fac"
        }
        ip_address {
            ip        = "10.10.11.76"
            ip_id     = "rni-b917084b8a114b4b8"
            subnet_id = "subnet-0d61a22daf3ac3f84"
        }
      - ip_address {
          - ip        = "10.10.12.82" -> null
          - ip_id     = "rni-1e44f05623e9432a9" -> null
          - subnet_id = "subnet-0c3a0fb5e89e2f001" -> null
        }
    }
```
However, the order of operations still does not seem right to me. Terraform is still _not destroying_ the resolver listener ENIs from the subnets being removed.

This causes the subnet deletion to fail (since you cannot delete a subnet with ENIs in that subnet).

```hcl
Plan: 1 to add, 1 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_subnet.private[2]: Destroying... [id=subnet-0c3a0fb5e89e2f001]
aws_subnet.private[2]: Still destroying... [id=subnet-0c3a0fb5e89e2f001, 10s elapsed]
aws_subnet.private[2]: Still destroying... [id=subnet-0c3a0fb5e89e2f001, 20s elapsed]
aws_subnet.private[2]: Still destroying... [id=subnet-0c3a0fb5e89e2f001, 30s elapsed]
aws_subnet.private[2]: Still destroying... [id=subnet-0c3a0fb5e89e2f001, 40s elapsed]
aws_subnet.private[2]: Still destroying... [id=subnet-0c3a0fb5e89e2f001, 50s elapsed]
aws_subnet.private[2]: Still destroying... [id=subnet-0c3a0fb5e89e2f001, 1m0s elapsed]

Error: Error deleting subnet: timeout while waiting for state to become 'destroyed' (last state: 'pending', timeout: 1m0s)
```

Let me know if it would be helful to provide a debug log of this run (with az IDs as keys, proper plan, but still failing to remove resources).